In [1]:
#OnehotEncoding

In [3]:
import numpy as np
import pandas as pd

In [5]:
df=pd.read_csv('tips.csv')

In [6]:
df.head(3)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3

In [7]:
from sklearn.preprocessing import OneHotEncoder

In [8]:
ohe=OneHotEncoder(drop='first',sparse_output=False,dtype=np.int32)

In [10]:
df_new=ohe.fit_transform(df[['sex','smoker','day','time']])

In [11]:
df_new

array([[0, 0, 0, 1, 0, 0],
       [1, 0, 0, 1, 0, 0],
       [1, 0, 0, 1, 0, 0],
       ...,
       [1, 1, 1, 0, 0, 0],
       [1, 0, 1, 0, 0, 0],
       [0, 0, 0, 0, 1, 0]])

In [13]:
df.shape

(244, 7)

In [14]:
df.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [16]:
#total_bill
#tip
#sex --> m,f
#smoker--> y,n
#day--> m,t,w,t
#time--> d,l
#size

In [17]:
# total_DF= 9
# Encoded_columns= 6

In [18]:
df_new_2=pd.DataFrame(df_new,columns=['sex_f','smoker_n','t','w','th','l'])

In [19]:
df_new_2

     sex_f  smoker_n  t  w  th  l
0        0         0  0  1   0  0
1        1         0  0  1   0  0
2        1         0  0  1   0  0
3        1         0  0  1   0  0
4        0         0  0  1   0  0
..     ...       ... .. ..  .. ..
239      1         0  1  0   0  0
240      0         1  1  0   0  0
241      1         1  1  0   0  0
242      1         0  1  0   0  0
243      0         0  0  0   1  0

[244 rows x 6 columns]

In [22]:
p=pd.get_dummies(df,columns=['sex','smoker','day','time'],drop_first=True)

In [23]:
p=p.astype(int)

In [24]:
p

,total_bill,tip,size,sex_Male,smoker_Yes,day_Sat,day_Sun,day_Thur,time_Lunch
0,16,1,2,0,0,0,1,0,0
1,10,1,3,1,0,0,1,0,0
2,21,3,3,1,0,0,1,0,0
3,23,3,2,1,0,0,1,0,0
4,24,3,4,0,0,0,1,0,0
...,...,...,...,...,...,...,...,...,...
239,29,5,3,1,0,1,0,0,0
240,27,2,2,0,1,1,0,0,0
241,22,2,2,1,1,1,0,0,0
242,17,1,2,1,0,1,0,0,0
243,18,3,2,0,0,0,0,1,0